Repository: senaite/senaite.queue
Catalog: src/senaite/queue/locales/*/LC_MESSAGES/senaite.queue.po
Languages: de

source: Analyses for {} have been queued
de: Analysen für {} wurden zur Warteschlange hinzugefügt

source: Analyst must be specified.
de: Analyst muss angegeben werden

source: Asynchronous tasks for SENAITE
de: Asynchrone Aufgabe für SENAITE

source: Context
de: Kontext

source: Created
de: Hinzugefügt

source: Default number of objects that will be handled in a single task. A value of 0 disables queuing of tasks functionality at all, specific tasks below included. Default value: 10
de: Standardanzahl an Objekten, die in einer einzigen Aufgabe verarbeitet werden. Ein Wert von 0 deaktiviert das hinzufügen von Aufgaben, untergeordnete Aufgaben eingeschlossen. Standardwert: 10

source: Default number of objects to process per task
de: Standardanzahl an Objekten die pro Aufgabe verarbeitet werden soll

source: Error message
de: Fehlermeldung

source: Maximum retries
de: Maximale Wiederholungen

source: Minimum number of seconds to book per task. If the task is performed very rapidly, it will have priority over a transaction done from userland. In case of conflict, the transaction from userland will fail and will be retried up to 3 times. This setting makes the thread that handles the task to take some time to complete, thus preventing threads from userland to be delayed or fail. Default value: 3
de: Mindestanzahl an Sekunden, die pro Aufgabe gebucht werden müssen. Wird die Aufgabe sehr schnell ausgeführt, wird diese gegenüber Transaktionen aus dem Userland bevorzugt. Im Konfliktfall wird die Transaktion aus dem Userland fehlschlagen und bis zu 3 mal wiederholt. Durch diese Einstellung dauert es einige Zeit, bis der Thread, der die Aufgabe bearbeitet, abgeschlossen ist, sodass Threads aus dem Userland nicht verzögert werden oder fehlschlagen. Standardwert: 3

source: Minimum seconds per task
de: Minimale Sekunden pro Aufgabe

source: No analyses were added
de: Es wurden keine Analysen hinzugefügt

source: Number of analyses that will be handled in a single task when assigned to a worksheet. Overrides default's for action 'assign'. A value of 0 disables the queue for this specific action. Default value: 10
de: Anzahl der Analysen, die in einer einzelnen Aufgabe verarbeitet werden, wenn sie einem Arbeitsblatt zugewiesen werden. Überschreibt die Standardeinstellungen für die Aktion 'Zuweisen'. Der Wert 0 deaktiviert die Warteschlange für diese bestimmte Aktion. Standardwert: 10

source: Number of analyses that will be handled in a single task when results are submitted. Overrides default's for 'submit' action. A value of 0 disables the queue for this specific action. Default value: 10
de: Anzahl der Analysen, die in einer einzelnen Aufgabe verarbeitet werden, wenn die Ergebnisse übermittelt werden. Überschreibt die Standardeinstellungen für die Aktion 'Senden'. Der Wert 0 deaktiviert die Warteschlange für diese bestimmte Aktion. Standardwert: 10

source: Number of analyses that will be handled in a single task when the analysis is rejected. Overrides default's for 'reject' action. A value of 0 disables the queue for this specific action. Default value: 10
de: Anzahl der Analysen, die in einer einzelnen Aufgabe verarbeitet werden, wenn die Analyse abgelehnt wird. Überschreibt die Standardeinstellungen für die Aktion 'Ablehnen'. Der Wert 0 deaktiviert die Warteschlange für diese bestimmte Aktion. Standardwert: 10

source: Number of analyses that will be handled in a single task when the analysis is retracted. Overrides default's for 'retract' action. A value of 0 disables the queue for this specific action. Default value: 10
de: Anzahl der Analysen, die in einer einzelnen Aufgabe verarbeitet werden, wenn die Analyse zurückgezogen wird. Überschreibt die Standardeinstellungen für die Aktion 'Zurückziehen'. Der Wert 0 deaktiviert die Warteschlange für diese bestimmte Aktion. Standardwert: 10

source: Number of analyses that will be handled in a single task when the analysis is verified. Overrides default's for 'reject' action. A value of 0 disables the queue for this specific action. Default value: 10
de: Anzahl der Analysen, die in einer einzelnen Aufgabe verarbeitet werden, wenn die Analyse überprüft wird. Überschreibt die Standardeinstellungen für die Aktion 'Ablehnen'. Der Wert 0 deaktiviert die Warteschlange für diese bestimmte Aktion. Standardwert: 10

source: Number of analyses to assign per task
de: Anzahl der pro Aufgabe zuzuweisenden Analysen

source: Number of analyses to reject per task
de: Anzahl der pro Aufgabe abzulehnenden Analysen

source: Number of analyses to retract per task
de: Anzahl der Analysen, die pro Aufgabe zurückgezogen werden müssen

source: Number of analyses to submit per task
de: Anzahl der pro Aufgabe einzureichenden Analysen

source: Number of analyses to unassign per task
de: Anzahl der Analysen, deren Zuordnung pro Aufgabe aufgehoben werden soll

source: Number of analyses to verify per task
de: Anzahl der pro Aufgabe zu überprüfenden Analysen

source: Number of seconds to wait for a process in queue to be finished before being considered as failed. Failed processes will be enqueued again. Minimum value: 30, Default value: 120
de: Anzahl der Sekunden, die gewartet werden muss, bis ein Prozess in der Warteschlange abgeschlossen ist, bevor er als fehlgeschlagen betrachtet wird. Fehlgeschlagene Prozesse werden erneut in die Warteschlange gestellt. Mindestwert: 30, Standardwert: 120

source: Number of times a task will be re-queued before being considered as failed. A value of 0 disables the re-queue of failing tasks. Default value: 3
de: Häufigkeit, mit der eine Aufgabe erneut in die Warteschlange gestellt wird, bevor sie als fehlgeschlagen betrachtet wird. Der Wert 0 deaktiviert die erneute Warteschlange für fehlgeschlagene Aufgaben. Standardwert: 3

source: Queue Settings
de: Warteschlangeneinstellungen

source: Queued
de: In Warteschlange

source: Queued tasks
de: Aufgaben in der Warteschlange

source: Remote Addr
de: Remote-Adresse

source: Remove
de: Entfernen

source: Requeue
de: Erneut in Warteschlange

source: Retries
de: Wiederholungen

source: SENAITE QUEUE (uninstall)
de: SENAITE QUEUE (deinstallieren)

source: SENAITE QUEUE Settings
de: SENAITE QUEUE Einstellungen

source: Seconds to wait before unlock
de: Wartezeit vor dem Entsperren in Sekunden

source: Type
de: Typ

source: User
de: Benutzer

source: analyses are being processed in background
de: Analysen werden im Hintergrund verarbeitet

source: analyses are being processed in background.
de: Analysen werden im Hintergrund verarbeitet

source: analysis is being processed in background
de: Analysen werden im Hintergrund verarbeitet

source: analysis is being processed in background.
de: Analysen werden im Hintergrund verarbeitet
